using System;
using System.Collections.Generic;
using System.Text;

namespace PatternsOfDesign.FactoryMethod
{
    class Home
    {
        //В данном паттерне проектирования рассмотрена тема логистики компании
        //основная идея в том, чтоб понять как создавать малосвязанные объекты.
        //условие

        //есть транспортная компания, которая занимается перевозкой грузов
        //изначально, компания занимался транспортировкой грузов на суше, но вот компания разрослась и имеет возможность транспортировать по морю, что делать?
        //необходимо:
        // 1. Создать абстрактный класс создателя объектов логистики с абстрактным методом, возвращающим интерфейс продукта
        // 2. Привести продукты к общему интерфейсу
        // 3. Реализовать

        //Для наглядности было добавлено несколько своих объектов и добавлены события
    }
}
